app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"  WHERE "locations"."user_id" = $1  [["user_id", 1]]
---
  def index
    if current_user.producer?
      @locations = current_user.locations
    else
      @locations = Location.all

INSERT INTO "locations" ("created_at", "empty_still_image_content_type", "empty_still_image_file_name", "empty_still_image_file_size", "empty_still_image_updated_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

UPDATE "locations" SET "number_cols" = $1, "number_rows" = $2, "time_to_clear_queue" = $3, "updated_at" = $4 WHERE "locations"."id" = 13  [["number_cols", 4], ["number_rows", 3], ["time_to_clear_queue", 1.2], ["updated_at", "2014-10-19 08:53:58.245796"]]
---
  def update
    respond_to do |format|
      if @location.update(location_params)